XML/Public/GETBANKACCOUNTSTRANS-PBQB01/request_pre/2022年3月1日/body_GETBANKACCOUNTSTRANS-PBQB01_request_pre_20220301203801.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:out="http://outsystem.ats.com.cn">
   <soapenv:Header/>
   <soapenv:Body>
      <out:outSystemWS>
         <out:in0>
<![CDATA[
<MBS>
<pub>
     <SRCOUTSYSTEMCODE>NC</SRCOUTSYSTEMCODE>
     <SRCBATCHNO>sandy20190314</SRCBATCHNO>
     <TRANSCODE>PBQB01</TRANSCODE>
     <TRANSDATETIME>2020-03-14 00:00:00</TRANSDATETIME>
     <MD5>158cfd893b0598f078f7efa4e6b11696</MD5>
    </pub>
    <req>
    <head>
    <COMMANDCODE>GETBANKACCOUNTSTRANS</COMMANDCODE>
          <PAGEINDEX>1</PAGEINDEX>
          <PAGESIZE>100</PAGESIZE>
    </head>
       <searchconditions>
       <TRADEDATESTART>2021-06-01</TRADEDATESTART>
       <TRADEDATEEND>2021-06-30</TRADEDATEEND>
       </searchconditions>
    </req>
</MBS>
         ]]>
</out:in0>
      </out:outSystemWS>
   </soapenv:Body>
</soapenv:Envelope>